import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class TermsConditionsScreen extends StatelessWidget {
  const TermsConditionsScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('شرایط و ضوابط'),
      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  'حریم خصوصی',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 20.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text(
                  "لینکیش خود را ملزم به محافظت از اطلاعات و حریم خصوصی کاربران می‌داند. "
                  "بخشی از اطلاعاتی که لینکیش ذخیره می‌کند اطلاعاتی است که شما به "
                  "صورت مستقیم در فرآیند ثبت نام و یا هنگام برداشت وجه اضافه می‌کنید.\n\n"
                  "این اطلاعات شامل موارد زیر می‌باشد:\n  - آدرس ایمیل\n  - آیدی صفحه اینستاگرام شما\n  - "
                  "منطقه جغرافیایی عموم مخاطبین شما در صفحه اینستاگرام شما\n  - "
                  "محتوای صفحه اینستاگرام شما\nاین موارد از مواردی هستند که پیش نیاز "
                  "استفاده از خدمات لینکیش می‌باشد که بتوانید در کمپین‌های تبلیغاتی شرکت کنید.",
                  style: TextStyle(
                    fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "لینکیش متعهد به فراهم کردن محیطی امن برای کاربران خود می‌باشد "
                    "که هم شامل اینفلوئنسرها (افراد تاثیرگذار) و هم بازاریاب ها می‌باشد. "
                    "برنامه‌ یا اطلاعات مخرب که از اطلاعات شخصی یا دستگاه کاربر سوء استفاده می‌کنند، "
                    "به هیچ عنوان در لینکیش توزیع نخواهد شد. "
                    "ایجاد فضای امن برای کاربران همواره از دغدغه‌های اصلی لینکیش می باشد.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "لینکیش متعهد به فراهم کردن محیطی امن برای کاربران خود می‌باشد "
                    "که هم شامل اینفلوئنسرها (افراد تاثیرگذار) و هم بازاریاب ها می‌باشد. "
                    "برنامه‌ یا اطلاعات مخرب که از اطلاعات شخصی یا دستگاه کاربر سوء استفاده می‌کنند، "
                    "به هیچ عنوان در لینکیش توزیع نخواهد شد. "
                    "ایجاد فضای امن برای کاربران همواره از دغدغه‌های اصلی لینکیش می باشد.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'استفاده از اطلاعات',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "بطور کلی از اطلاعات افراد هیچ گونه استفاده غیر از اهداف تعریف شده "
                    "لینکیش نخواهد شد که صرفا برای پیشنهاد کمپین های تبلیغاتیِ مرتبط می باشد. "
                    "لذا در موارد زیر ممکن است اطلاعات مورد استفاده قرار بگیرد چرا که استفاده کاربر "
                    "از سرویس لینکیش به منزله قبول و اعطای اختیار به لینکیش جهت استفاده و "
                    "بهره‌برداری از اطلاعات فوق الذکر به شرح زیر می‌باشد:\n  - ارائه، نگهداری "
                    "و بهبود کیفیت خدمات در کمپین های تبلیغاتی؛\n  - برقراری ارتباط بین پروفایل "
                    "کاربر و محتوای ارسالی برای تبلیغات؛ به طور مثال آگهی تبلیغاتیِ پیشنهاد شده "
                    "به هر کاربر بدین صورت است که همخوانی زیادی با محتوای صفحه اینستاگرام کاربر دارد؛\n"
                    "  - بدیهی است مسئولیت حفظ و نگهداری از تمامی اطلاعات فوق الذکر بر عهده لینکیش می باشد؛"
                    " به نحوی که هیچ شخصی اعم از حقیقی و یا حقوقی غیر ذیصلاح حق دسترسی به اطلاعات مذکور را "
                    "نخواهد داشت. صرفاً در صورتی که طبق درخواست و یا صدور دستور مقتضی از سوی مراجع قضایی، "
                    "اطلاعات کاربر - اعم از اینکه به صورت مستقیم از سوی ایشان و یا به صورت خودکار "
                    "جمع‌آوری و ضبط شده باشد - مطالبه شود، "
                    "لینکیش موظف به ارایۀ اطلاعات درخواستی به مراجع مذکور خواهد بود.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "در صورت هرگونه مشکل کاربران از سه طریق میتوانند با ما در ارتباط باشند:"
                    " اول از طریق ارتباط با ما در اپلیکیشن دوم از طریق آدرس ایمیل support@linkish.ir"
                    " و سوم از طریق فرم ارتباط با ما بر روی وب سایت www.linkish.ir",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
