import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class TermsConditionsScreen extends StatelessWidget {
  const TermsConditionsScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('شرایط و ضوابط'),
      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(
                  'حریم خصوصی',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 20.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text(
                  "لینکیش خود را ملزم به محافظت از اطلاعات و حریم خصوصی کاربران می‌داند. "
                  "بخشی از اطلاعاتی که لینکیش ذخیره می‌کند اطلاعاتی است که شما به "
                  "صورت مستقیم در فرآیند ثبت نام و یا هنگام برداشت وجه اضافه می‌کنید.\n\n"
                  "این اطلاعات شامل موارد زیر می‌باشد:\n  - آدرس ایمیل\n  - آیدی صفحه اینستاگرام شما\n  - "
                  "منطقه جغرافیایی عموم مخاطبین شما در صفحه اینستاگرام شما\n  - "
                  "محتوای صفحه اینستاگرام شما\nاین موارد از مواردی هستند که پیش نیاز "
                  "استفاده از خدمات لینکیش می‌باشد که بتوانید در کمپین‌های تبلیغاتی شرکت کنید.",
                  style: TextStyle(
                    fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "لینکیش متعهد به فراهم کردن محیطی امن برای کاربران خود می‌باشد "
                    "که هم شامل اینفلوئنسرها (افراد تاثیرگذار) و هم بازاریاب ها می‌باشد. "
                    "برنامه‌ یا اطلاعات مخرب که از اطلاعات شخصی یا دستگاه کاربر سوء استفاده می‌کنند، "
                    "به هیچ عنوان در لینکیش توزیع نخواهد شد. "
                    "ایجاد فضای امن برای کاربران همواره از دغدغه‌های اصلی لینکیش می باشد.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "لینکیش متعهد به فراهم کردن محیطی امن برای کاربران خود می‌باشد "
                    "که هم شامل اینفلوئنسرها (افراد تاثیرگذار) و هم بازاریاب ها می‌باشد. "
                    "برنامه‌ یا اطلاعات مخرب که از اطلاعات شخصی یا دستگاه کاربر سوء استفاده می‌کنند، "
                    "به هیچ عنوان در لینکیش توزیع نخواهد شد. "
                    "ایجاد فضای امن برای کاربران همواره از دغدغه‌های اصلی لینکیش می باشد.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'استفاده از اطلاعات',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "بطور کلی از اطلاعات افراد هیچ گونه استفاده غیر از اهداف تعریف شده "
                    "لینکیش نخواهد شد که صرفا برای پیشنهاد کمپین های تبلیغاتیِ مرتبط می باشد. "
                    "لذا در موارد زیر ممکن است اطلاعات مورد استفاده قرار بگیرد چرا که استفاده کاربر "
                    "از سرویس لینکیش به منزله قبول و اعطای اختیار به لینکیش جهت استفاده و "
                    "بهره‌برداری از اطلاعات فوق الذکر به شرح زیر می‌باشد:\n  - ارائه، نگهداری "
                    "و بهبود کیفیت خدمات در کمپین های تبلیغاتی؛\n  - برقراری ارتباط بین پروفایل "
                    "کاربر و محتوای ارسالی برای تبلیغات؛ به طور مثال آگهی تبلیغاتیِ پیشنهاد شده "
                    "به هر کاربر بدین صورت است که همخوانی زیادی با محتوای صفحه اینستاگرام کاربر دارد؛\n"
                    "  - بدیهی است مسئولیت حفظ و نگهداری از تمامی اطلاعات فوق الذکر بر عهده لینکیش می باشد؛"
                    " به نحوی که هیچ شخصی اعم از حقیقی و یا حقوقی غیر ذیصلاح حق دسترسی به اطلاعات مذکور را "
                    "نخواهد داشت. صرفاً در صورتی که طبق درخواست و یا صدور دستور مقتضی از سوی مراجع قضایی، "
                    "اطلاعات کاربر - اعم از اینکه به صورت مستقیم از سوی ایشان و یا به صورت خودکار "
                    "جمع‌آوری و ضبط شده باشد - مطالبه شود، "
                    "لینکیش موظف به ارایۀ اطلاعات درخواستی به مراجع مذکور خواهد بود.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "در صورت هرگونه مشکل کاربران از سه طریق میتوانند با ما در ارتباط باشند:"
                    " اول از طریق ارتباط با ما در اپلیکیشن دوم از طریق آدرس ایمیل support@linkish.ir"
                    " و سوم از طریق فرم ارتباط با ما بر روی وب سایت www.linkish.ir",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              SizedBox(height: 20),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0, bottom: 8.0),
                child: Text(
                  'قوانین و شرایط استفاده از برنامه',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 20.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text("تبلیغات ارسالی با توجه به مشخصات پروفایل شما برایتان ارسال می‌گردد"
                    " که محتوای تبلیغاتی لینکیش همخوانی بیشتری با پیج اینستاگرام شما داشته باشد."
                    " با این وجود بعد از پیشنهاد آگهی برای شما که با ایمیل نیز "
                    "به شما اطلاع داده می‌شود در صفحه خانه شما سه گزینه انتخاب دارید.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'ورود به کمپین',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "با زدن این دکمه شما می‌پذیرید که وارد این کمپین تبلیغاتی شوید و "
                    "محتوای تبلیغاتی آماده دانلود و قرارگیری بر روی اکانت اینستاگرام شما "
                    "به صورت استوری (story) می‌باشد. لینک مربوط به هر تبلیغ به طور خاص برای شما تولید می‌شود"
                    " که به منظور swipe up باید لینک به همراه محتوای تبلیغاتی در استوری شما قرار گیرد."
                    "\nتوجه: زمان هر کمپین تبلیغاتی 24 ساعت می‌باشد که معادل مدت زمان استوری اینستاگرام است"
                    " و لینک تبلیغاتی بعد از 24 ساعت غیرفعال می‌شود.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'رد کردن کمپین',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "در صورت نا همخوان بودن محتوای تبلیغ با محتوای صفحه شما و "
                    "یا به هر دلیل دیگر شما می‌توانید از شرکت در این کمپین تبلیغاتی صرف نظر کنید.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'گزارش کردن آگهی',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "هرچند عوامل اجرایی و تیم لینکیش تابع قوانین و ضوابط جمهوری اسلامی ایران هستند، "
                    "درصورتی که شما متوجه شدید آگهی ارسالی برای شما با مضامین سیاسی و "
                    "یا غیر اخلاقی یا موارد دیگر است می‌توانید با زدن این دکمه آگهی مربوطه را گزارش کنید.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'روش کسب درآمد',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "پس از ورود به کمپین و قرار دادن لینک و محتوای مربوطه در استوری اینستاگرام خود،"
                    " شما شروع به کسب درآمد با لینکیش کرده‌اید. بدین صورت که فالوئر‌های شما"
                    " با کلیک بر لینک موجود در استوری به سایت اصلی آگهی ارجاع داده می‌شوند. به عبارت دیگر "
                    "به ازای هر کلیک بر روی لینک شما کسب درآمد می‌کنید. این درآمد در کیف پول شما در "
                    "لینکیش بطور خودکار واریز می‌شود.\nتوجه داشته باشید که لینکیش با کمک هوش مصنوعی برخی از کلیک ها "
                    "را حساب نمی‌کند و یا جلوی تقلب ها را می‌گیرد. "
                    "بطور مثال اگر کسی چندین بار بر روی لینک کلیک کند فقط یکبار برای او شمارش می‌شود.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.only(top: 18.0, right: 8.0),
                child: Text(
                  'دریافت وجه',
                  style: TextStyle(
                    fontWeight: FontWeight.bold,
                    fontSize: 16.0,
                  ),
                ),
              ),
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Text( "دریافت وجه به صورت کارت به کارت یا پایا برای شما انجام می‌شود به همین علت شماره "
                    "شبا و شماره کارت بانکی شما لازم می‌باشد. محدودیت‌هایی در روزهای "
                    "اول کسب و کار خواهیم داشت؛ بطور مثال در حداقل میزان دریافت وجه نقد که با تسهیل روند "
                    "اتوماسیون بانکی و مجوز بانکی این محدودیت برطرف خواهد شد."
                    "\nحداقل موجودی کیف پول شما باید یک میلیون ریال "
                    "یا معادل صدهزار تومان باشد تا بتوانید درخواست خود را برای دریافت وجه ثبت کنید.",
                  style: TextStyle(
                      fontSize: 15.0
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
